//------------------------------------------------
//В этом файле находятся две таблицы:
//plants и animals, которые имеют простую структуру
//  plants = [
//    ['Название ПП в одинарных кавычках',БЕЛКИ, ЖИРЫ, УГЛЕВОДЫ, ЭНЕРГИЯ],
//    ...
//    ...
//    [Если это последняя запись, то после квадратной скобки запятая не нужна]
//  ];
//В общем, таблица заполняется по тому же принципу, по которому она частично уже заполнена.
//
//ВАЖНО! Ошибочная запись в данном файле может нарушить работоспособность программы.
//При слишком большом числе записей браузер может начать тормозить. Тогда следует
//удалить наиболее ненужные строки из таблицы.


//------------------------------------------------
//Таблица растительных продуктов питания
//------------------------------------------------
var plants = [

  ['Миндаль',20.5,53.3,4.3,580.0],
  ['Яблоки',0.3,0.0,12.0,46.0],
  ['Абрикосы консервированные',0.5,0.0,27.7,106.0],
  ['Бананы',1.1,0.0,19.2,76.0],
  ['Бобы консервированные в томатном соусе',5.1,0.4,10.3,63.0],
  ['Фасоль огненно-красная',2.2,0.0,3.9,23.0],
  ['Пиво горькое из бочки',0.0,0.0,2.3,30.0],
  ['Свекла вареная',1.8,0.0,9.9,44.0],
  ['Печенье сухое. полусладкое',7.4,13.2,75.3,431.0],
  ['Хлеб черный',9.2,1.4,48.3,230.0],
  ['Хлеб белый',8.0,1.7,54.3,251.0],
  ['Хлеб из непросеянной муки',9.6,3.1,46.7,241.0],
  ['Капуста брюссельская. вареная',2.8,0.0,1.7,17.0],
  ['Капуста кочанная. вареная',1.7,0.0,2.3,15.0],
  ['Морковь',0.7,0.0,5.4,23.0],
  ['Капуста цветная',1.9,0.0,1.5,13.0],
  ['Шоколад молочный',8.7,37.6,54.5,578.0],
  ['Кокосовый орех. сушеный',6.6,62.0,6.4,608.0],
  ['Кофе растворимый',4.0,0.7,35.5,155.0],
  ['Кукурузные хлопья',7.4,0.4,85.4,354],
  ['Мука крупчатка',10,0.9,80,348],
  ['Фруктовый кекс',4.6,15.9,55,368],
  ['Джем',0.5,0,69.2,262],
  ['Салат',1,0,1.2,8],
  ['Маргарин',0.2,81.5,0,734],
  ['Столовый жир и растительное масло',0,99.9,0,899],
  ['Лук',0.9,0,5.2,23],
  ['Апельсины',0.8,0,8.5,35],
  ['Пастернак посевной',1.7,0,11.3,49],
  ['Персики консервированные',0.4,0,22.9,88],
  ['Арахис жареный',28.1,49,8.6,586],
  ['Груши свежие',0.3,0,10.6,41],
  ['Горох (свежий или быстро замороженный) вареный',5,0,7.7,49],
  ['Ананасы консервированные',0.3,0,20,76],
  ['Кекс без фруктов',6,24,49.7,426],
  ['Изюм',0.6,0,7.9,32],
  ['Картофель вареный',1.4,0,19.7,80],
  ['Картофель фри',3.8,9,37.3,236],
  ['Картофель жареный',2.8,1,27.3,111],
  ['Чернослив',2.4,0,40.3,161],
  ['Малина',0.9,0,5.6,25],
  ['Ревень',0.6,0,1,6],
  ['Рис',6.2,1,86.8,359],
  ['Рисовый пудинг',3.6,7.6,15.7,142],
  ['Томатный суп консервированный',0.8,3.3,5.9,55],
  ['Спагетти',9.9,1,84,364],
  ['Шпинат',2.7,0,2.8,21],
  ['Спирт 70%-ный',0,0,0,221],
  ['Клубника. земляника',0.6,0,6.2,26],
  ['Сахар-рафинад',0,0,105,394],
  ['Сахарная   кукуруза консервированная',2.9,0.8,16.1,79],
  ['Сироп',0.3,0,79,298],
  ['Помидоры свежие',0.8,0,2.4,12],
  ['Кресс-салат',2.9,0,0.7,14],
  ['Вино красное',0,0,0.3,67]
  
];

//------------------------------------------------
//Таблица животных продуктов питания
//------------------------------------------------
var animals = [

  ['Бекон. ветчина (вареные)',  24.5,38.8,0.00,447.0],
  ['Говядина обычная',          18.1,17.1,0.00,226.0],
  ['Говяжья солонина',          26.9,12.1,0.00,216.0],
  ['Масло',                     0.50,81.0,0.00,731.0],
  ['Сыр чеддер',                25.4,34.5,0.00,412.0],
  ['Цыпленок жареный',          24.8,5.40,0.00,148.0],
  ['Треска. запеченная в тесте',19.6,10.3,7.50,199.0],
  ['Треска. пикша. белая рыба', 17.4,0.70,0.00,76.00],
  ['Сливки  двоиные',           1.80,48.0,2.60,449.0],
  ['Сливки одинарные',          2.80,18.0,4.20,189.0],
  ['Яйца',                      12.3,10.9,0.00,147.0],
  ['Рыбные палочки',            12.6,7.50,16.1,178.0],
  ['Окорок вареный',            24.7,18.9,0.00,269.0],
  ['Мед',                       0.40,0.00,76.4,288.0],
  ['Мороженое ванильное',       4.10,11.3,19.8,192.0],
  ['Рыба копченая',             19.8,11.7,0.00,184.0],
  ['Баранина жареная',          23.0,22.1,0.00,291.0],
  ['Печень жареная',            24.9,13.7,5.60,244.0],
  ['Мясо для завтрака',         12.6,26.9,5.50,313.0],
  ['Мармелад',                  0.10,0.00,69.5,261.0],
  ['Молоко жидкое. цельное',    3.30,3.80,4.80,65.00],
  ['Свинина обычная',           15.8,29.6,0.00,330.0],
  ['Колбаса свиная',            10.6,32.1,9.50,367.0],
  ['Бифштекс и пирог с почками',13.3,21.1,14.6,304.0],
  ['Йогурт фруктовый',          4.80,1.00,18.2,96.00],
  ['Йогурт натуральный',        5.00,1.00,6.40,53.00]
  
];
//------------------------------------------------
